In [1]:
#TASK 1
import pandas as pd
import numpy as np

#create dataframe for project data
data1={
    'Id':['A001','A002','A003','A004','A005','A002','A005','A003','A001','A003','A001','A004','A004','A005'],
    'Project':['Project 1','Project 2','Project 3','Project 4','Project 5','Project 6','Project 7','Project 8','Project 9','Project 10','Project 11','Project 12','Project 13','Project 14'],
    'Cost':[1002000,2000000,4500000,5500000,np.nan,680000,400000,350000,np.nan,300000,2000000,1000000,3000000,200000],
    'Status':['Finished','Ongoing','Finished','Ongoing','Finished','Failed','Finished','Failed','Ongoing','Finished','Failed','Ongoing','Finished','Finished']
}
df1=pd.DataFrame(data1)

#save the data frame as a CSV file
df1.to_csv('Project_data.csv',index=False)
print(df1)

      Id     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [3]:
data2={
    'Id':['A001','A002','A003','A004','A005'],
    'Name':['John Alter','Alice Luxumberg','Tom Sabestine','Nina Adgra','Amy Johny'],
    'Gender':['M','F','M','F','F'],
    'City':['Paris','London','Berline','Newyork','Madrid'],
    'Age':[25,27,29,31,30]
}
df2=pd.DataFrame(data2)

#create the second dataframe
df2.to_csv('Employee_DataFrame.csv',index=False)
print(df2)

     Id             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M  Berline   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [5]:
data3={
    'Id':['A001','A002','A003','A004','A005'],
    'Designation Level':[2,2,3,2,3]
}
df3=pd.DataFrame(data3)

#Create third data frame
df3.to_csv('Seniority_Level_Data_Frame.csv',index=False)
print(df3)

     Id  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [7]:
#TASK 2

# print original data frame
print("ORIGINAL DATAFRAME")
print(df1)

#Compute the running average
running_average=[]
for i in range(len(df1['Cost'])):
    if i==0:
        running_average.append(df1['Cost'][i])
    else:
         running_average.append((df1['Cost'][i-1]+df1['Cost'][i])/2)
#replace the missing values with the running average
df1['Cost']=df1['Cost'].interpolate(method='linear',limit_direction='both',limit=100)

#print the updated dataframe
print("\n Updated Data Frame:")
print(df1)

ORIGINAL DATAFRAME
      Id     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

 Updated Data Frame:
      Id     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3090000.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9   325000.0   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [9]:
#TASK 3

#print the original data frame
print("ORIGINAL DATAFRAME:")
print(df2)

#split the "Name" column into 'First Name' and 'Last Name'
df2[['First Name','Last Name']]=df2['Name'].str.split(expand=True)

#Remove the older 'Name' column
df2=df2.drop('Name',axis=1)

#Print the updated data frame
print("\n UPDATED DATA FRAME:")
print(df2)

ORIGINAL DATAFRAME:
     Id             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M  Berline   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

 UPDATED DATA FRAME:
     Id Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M  Berline   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [11]:
#TASK 4

#Join the three dataframe into one single dataframe
Final=pd.merge(df1,df2,on='Id')
Final=pd.merge(Final,df3,on='Id')

#print the final dataframe
print("Final DataFrame:")
print(Final)

Final DataFrame:
      Id     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M  Berline   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3090000.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M  Berline   29        Tom
8   A001   Project 9   325000.0   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M  Berline   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

In [13]:
#TASK 5

#Print Final Data frame before adding Bonus column
print("Final Data frame before adding Bonus column")
print(Final)

#Add a new bonus column in the Final DataFrame
Final['Bonus']=0
Final.loc[Final['Status']=='Finished','Bonus']=Final.loc[Final['Status']=='Finished','Cost'].apply(lambda x:x*0.05)

#Print the Final Dataframe after adding Bonus column:")
print("\n Final Data frame after adding Bonus column:")
print(Final)

Final Data frame before adding Bonus column
      Id     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M  Berline   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3090000.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M  Berline   29        Tom
8   A001   Project 9   325000.0   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M  Berline   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

 Final Data frame after adding Bonus column:
      Id     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M  Berline   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3090000.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M  Berline   29        Tom
8   A001   Project 9   325000.0   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M  Berline   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level   Bonus
0       Alter                  2   50100
1   Luxumberg                  2       0
2   Sabestine                  3  225000
3       Adgra                  2       0
4       Johny                  3  154500
5   Luxumberg                  2       0
6       Johny                  3   20000
7   Sabestine                  3       0
8       Alter                  2       0
9   Sabestine                  3   15000
10      Alter                  2       0
11      Adgra                  2       0
12      Adgra                  2  150000
13      Johny                  3   10000

In [15]:
#Task 6
print(Final)

#Demote the designation level by 1 for employees whose project has a status of 'Failed'

Final.loc[Final['Status']=='Failed','Designation Level']=Final.loc[Final['Status']=='Failed','Designation Level']-1

#Delete the employees Record whose designation level is above 4
Final=Final[Final['Designation Level']<=4]

#Print the Updated datframe after making the changes 
print("Final DataFrame after doing the changes related to designation level")
print(Final)

      Id     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M  Berline   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3090000.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M  Berline   29        Tom
8   A001   Project 9   325000.0   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M  Berline   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level   Bonus
0       Alter                  2   50100
1   Luxumberg                  2       0
2   Sabestine                  3  225000
3       Adgra                  2       0
4       Johny                  3  154500
5   Luxumberg                  2       0
6       Johny                  3   20000
7   Sabestine                  3       0
8       Alter                  2       0
9   Sabestine                  3   15000
10      Alter                  2       0
11      Adgra                  2       0
12      Adgra                  2  150000
13      Johny                  3   10000
Final DataFrame after doing the changes related to designation level
      Id     Project       Cost    Status Gender     City  Age First Name  \
0   A001   Project 1  1002000.0  Finished      M    Paris   25       John
1   A002   Project 2  2000000.0   Ongoing      F   London   27      Alice
2   A003   Project 3  4500000.0  Finished      M  Berline   29        Tom
3   A004   Project 4  5500000.0   Ongoing      F  Newyork   31       Nina
4   A005   Project 5  3090000.0  Finished      F   Madrid   30        Amy
5   A002   Project 6   680000.0    Failed      F   London   27      Alice
6   A005   Project 7   400000.0  Finished      F   Madrid   30        Amy
7   A003   Project 8   350000.0    Failed      M  Berline   29        Tom
8   A001   Project 9   325000.0   Ongoing      M    Paris   25       John
9   A003  Project 10   300000.0  Finished      M  Berline   29        Tom
10  A001  Project 11  2000000.0    Failed      M    Paris   25       John
11  A004  Project 12  1000000.0   Ongoing      F  Newyork   31       Nina
12  A004  Project 13  3000000.0  Finished      F  Newyork   31       Nina
13  A005  Project 14   200000.0  Finished      F   Madrid   30        Amy

    Last Name  Designation Level   Bonus
0       Alter                  2   50100
1   Luxumberg                  2       0
2   Sabestine                  3  225000
3       Adgra                  2       0
4       Johny                  3  154500
5   Luxumberg                  1       0
6       Johny                  3   20000
7   Sabestine                  2       0
8       Alter                  2       0
9   Sabestine                  3   15000
10      Alter                  1       0
11      Adgra                  2       0
12      Adgra                  2  150000
13      Johny                  3   10000

In [17]:
#Task 7

#Add "Mr." and "Mrs." tp the first name column
Final['First Name']=Final['First Name'].str.split().str[0]
Final['Title']= Final.apply(lambda x:'Mr.'if x['Gender']=='M' else 'Mrs.' if x['Gender']=='F' else None, axis=1)
Final['First Name']=Final.apply(lambda x: x['Title']+''+x['First Name'] if x['Title']is not None else x['First Name'],axis=1)

#Drop the Gender Column
Final=Final.drop(columns=['Gender','Title'])

#Print the updated data frame
print("Data Frame after addinf title to first name and removing the gender column")
print(Final)

Data Frame after addinf title to first name and removing the gender column
      Id     Project       Cost    Status     City  Age First Name  Last Name  \
0   A001   Project 1  1002000.0  Finished    Paris   25    Mr.John      Alter
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs.Alice  Luxumberg
2   A003   Project 3  4500000.0  Finished  Berline   29     Mr.Tom  Sabestine
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs.Nina      Adgra
4   A005   Project 5  3090000.0  Finished   Madrid   30    Mrs.Amy      Johny
5   A002   Project 6   680000.0    Failed   London   27  Mrs.Alice  Luxumberg
6   A005   Project 7   400000.0  Finished   Madrid   30    Mrs.Amy      Johny
7   A003   Project 8   350000.0    Failed  Berline   29     Mr.Tom  Sabestine
8   A001   Project 9   325000.0   Ongoing    Paris   25    Mr.John      Alter
9   A003  Project 10   300000.0  Finished  Berline   29     Mr.Tom  Sabestine
10  A001  Project 11  2000000.0    Failed    Paris   25    Mr.John      Alter
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs.Nina      Adgra
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs.Nina      Adgra
13  A005  Project 14   200000.0  Finished   Madrid   30    Mrs.Amy      Johny

    Designation Level   Bonus
0                   2   50100
1                   2       0
2                   3  225000
3                   2       0
4                   3  154500
5                   1       0
6                   3   20000
7                   2       0
8                   2       0
9                   3   15000
10                  1       0
11                  2       0
12                  2  150000
13                  3   10000

In [19]:
#Task 8

#Promote designation level by 1 for the employee whose age is more than 29 years
Final['Designation Level']=Final.apply(lambda x:x['Designation Level']+1 if x['Age']>29 else x['Designation Level'],axis=1)

#print the final data frame after making the changes on designation level based on age
print("\n Final Data frame after changing the designation level based on age")
print(Final)

 Final Data frame after changing the designation level based on age
      Id     Project       Cost    Status     City  Age First Name  Last Name  \
0   A001   Project 1  1002000.0  Finished    Paris   25    Mr.John      Alter
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs.Alice  Luxumberg
2   A003   Project 3  4500000.0  Finished  Berline   29     Mr.Tom  Sabestine
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs.Nina      Adgra
4   A005   Project 5  3090000.0  Finished   Madrid   30    Mrs.Amy      Johny
5   A002   Project 6   680000.0    Failed   London   27  Mrs.Alice  Luxumberg
6   A005   Project 7   400000.0  Finished   Madrid   30    Mrs.Amy      Johny
7   A003   Project 8   350000.0    Failed  Berline   29     Mr.Tom  Sabestine
8   A001   Project 9   325000.0   Ongoing    Paris   25    Mr.John      Alter
9   A003  Project 10   300000.0  Finished  Berline   29     Mr.Tom  Sabestine
10  A001  Project 11  2000000.0    Failed    Paris   25    Mr.John      Alter
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs.Nina      Adgra
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs.Nina      Adgra
13  A005  Project 14   200000.0  Finished   Madrid   30    Mrs.Amy      Johny

    Designation Level   Bonus
0                   2   50100
1                   2       0
2                   3  225000
3                   3       0
4                   4  154500
5                   1       0
6                   4   20000
7                   2       0
8                   2       0
9                   3   15000
10                  1       0
11                  3       0
12                  3  150000
13                  4   10000

In [21]:
#Task 9
#create a new dataframe to store the total project cost for each employee
TotalProjectCost=Final.groupby('Id')['Cost'].sum().reset_index()
TotalProjectCost.columns=['Id','Total Cost']
TotalProjectCost['First Name']=Final.loc[Final['Id'].isin(TotalProjectCost['Id']),'First Name'].unique()

#Print the total project cost for each employee
print(TotalProjectCost)

     Id  Total Cost First Name
0  A001   3327000.0    Mr.John
1  A002   2680000.0  Mrs.Alice
2  A003   5150000.0     Mr.Tom
3  A004   9500000.0   Mrs.Nina
4  A005   3690000.0    Mrs.Amy

In [23]:
#Task 10

#print all the employee details whose city name contains the letter "o" in it
print(Final[Final['City'].apply(lambda x:'o' in x)])

      Id     Project       Cost    Status     City  Age First Name  Last Name  \
1   A002   Project 2  2000000.0   Ongoing   London   27  Mrs.Alice  Luxumberg
3   A004   Project 4  5500000.0   Ongoing  Newyork   31   Mrs.Nina      Adgra
5   A002   Project 6   680000.0    Failed   London   27  Mrs.Alice  Luxumberg
11  A004  Project 12  1000000.0   Ongoing  Newyork   31   Mrs.Nina      Adgra
12  A004  Project 13  3000000.0  Finished  Newyork   31   Mrs.Nina      Adgra

    Designation Level   Bonus
1                   2       0
3                   3       0
5                   1       0
11                  3       0
12                  3  150000